waveonly/wavemakerBased/interIsoFoam/F14_0deg/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  5                                     |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/polyMesh";
    object      blockMeshDict;
}

vertices
(
    (0.000 -15.000 -3.000)
    (0.6500 -15.000 -3.000)
    (0.6500 -15 -3.000)
    (0.000 -15 -3.000)
    (20.000 -15.000 -3.000)
    (20.000 -15 -3.000)
    (0.000 15 -3.000)
    (0.6500 15 -3.000)
    (20.000 15 -3.000)
    (0.000 15.000 -3.000)
    (0.6500 15.000 -3.000)
    (20.000 15.000 -3.000)
    (0.000 -15.000 -0.660)
    (0.6500 -15.000 -0.660)
    (0.6500 -15 -0.660)
    (0.000 -15 -0.660)
    (20.000 -15.000 -0.660)
    (20.000 -15 -0.660)
    (0.000 15 -0.660)
    (0.6500 15 -0.660)
    (20.000 15 -0.660)
    (0.000 15.000 -0.660)
    (0.6500 15.000 -0.660)
    (20.000 15.000 -0.660)
    (0.000 -15.000 0.825)
    (0.6500 -15.000 0.825)
    (0.6500 -15 0.825)
    (0.000 -15 0.825)
    (20.000 -15.000 0.825)
    (20.000 -15 0.825)
    (0.000 15 0.825)
    (0.6500 15 0.825)
    (20.000 15 0.825)
    (0.000 15.000 0.825)
    (0.6500 15.000 0.825)
    (20.000 15.000 0.825)
    (0.000 -15.000 2.000)
    (0.6500 -15.000 2.000)
    (0.6500 -15 2.000)
    (0.000 -15 2.000)
    (20.000 -15.000 2.000)
    (20.000 -15 2.000)
    (0.000 15 2.000)
    (0.6500 15 2.000)
    (20.000 15 2.000)
    (0.000 15.000 2.000)
    (0.6500 15.000 2.000)
    (20.000 15.000 2.000)
);

blocks
(
 
    hex (3 2 7 6 15 14 19 18) (1 1 11) simpleGrading (1 1 0.166667)
    hex (2 5 8 7 14 17 20 19) (361 1 11) simpleGrading (1 1 0.166667)
    hex (15 14 19 18 27 26 31 30) (1 1 27) simpleGrading (1 1 1)
    hex (14 17 20 19 26 29 32 31) (361 1 27) simpleGrading (1 1 1)
    hex (27 26 31 30 39 38 43 42) (1 1 5) simpleGrading (1 1 6)
    hex (26 29 32 31 38 41 44 43) (361 1 5) simpleGrading (1 1 6)
);

edges
(
);

boundary
(
    waveMaker
    {
        type patch;
        faces
        (
            (3	6	18	15)
            (15	18	30	27)
            (27	30	42	39)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (5	8	20	17)
            (17	20	32	29)
            (29	32	44	41)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (3	2	7	6)
            (2	5	8	7)
        );
    }
    atmosphere
    {
        type wall;
        faces
        (
            (39 38 43	42)
            (38 41 44	43)
        );
    }
    walls
    {
        type empty;
        faces
        (
            (3 2 14 15)
            (6 18 19 7)
            
            (2 5 17 14)
            (8 20 19 7)
            
            (15 14 26 27)
            (19 31 30 18)
            
            (14 17 29 26)
            (20 32 31 19)
            
            (27 26 38 39)
            (31 43 42 30)
            
            (26 29 41 38)
            (32 44 43 31)
            
            
            
        );
    }
);
