waveonly/wavemakerBased/interIsoFoam/F14_0deg/constant/wavemakerMovementDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v2212                                     |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/";
    object      waveDict;
}
//---------------------------------------------------------------------------*//

wavemakerType   Flap;
nPaddles   1;
genAbs          1;
hingeHeight    -1.500000;

timeSeries 601(
0.000000
0.100000
0.200000
0.300000
0.400000
0.500000
0.600000
0.700000
0.800000
0.900000
1.000000
1.100000
1.200000
1.300000
1.400000
1.500000
1.600000
1.700000
1.800000
1.900000
2.000000
2.100000
2.200000
2.300000
2.400000
2.500000
2.600000
2.700000
2.800000
2.900000
3.000000
3.100000
3.200000
3.300000
3.400000
3.500000
3.600000
3.700000
3.800000
3.900000
4.000000
4.100000
4.200000
4.300000
4.400000
4.500000
4.600000
4.700000
4.800000
4.900000
5.000000
5.100000
5.200000
5.300000
5.400000
5.500000
5.600000
5.700000
5.800000
5.900000
6.000000
6.100000
6.200000
6.300000
6.400000
6.500000
6.600000
6.700000
6.800000
6.900000
7.000000
7.100000
7.200000
7.300000
7.400000
7.500000
7.600000
7.700000
7.800000
7.900000
8.000000
8.100000
8.200000
8.300000
8.400000
8.500000
8.600000
8.700000
8.800000
8.900000
9.000000
9.100000
9.200000
9.300000
9.400000
9.500000
9.600000
9.700000
9.800000
9.900000
...
);

paddleTilt 1(
601(
0.000000
-0.000434
-0.000808
-0.001017
-0.001005
-0.000746
-0.000193
0.000666
0.001731
0.002875
0.004043
0.005152
0.005982
0.006346
0.006230
0.005627
0.004394
0.002476
0.000090
-0.002536
-0.005373
-0.008297
-0.010886
-0.012776
-0.013935
-0.014301
-0.013521
-0.011396
-0.008208
-0.004247
0.000538
0.006020
0.011524
0.016436
0.020657
0.023996
0.025732
0.025354
0.023102
0.019224
0.013425
0.005701
-0.003045
-0.011934
-0.020824
-0.029302
-0.035446
-0.038817
-0.039644
-0.038128
-0.033670
-0.026077
-0.016395
-0.005643
0.006109
0.018498
0.029968
0.039176
0.046073
0.050556
0.051435
0.047934
0.040888
0.031228
0.018705
0.003454
-0.012673
-0.027846
-0.041822
-0.054280
-0.063265
-0.067098
-0.066249
-0.061471
-0.051841
-0.036775
-0.018222
0.001464
0.022063
0.043420
0.062760
0.077038
0.086189
0.090962
0.089450
0.079456
0.062565
0.041911
0.017531
-0.011560
-0.042227
-0.069264
-0.091516
-0.110473
-0.123667
-0.125851
-0.116709
-0.100701
-0.078664
...
);
